Revit 2027 API
DividedSurface.GetGridNodeLocation Method
Specify whether a particular grid node is interior to the surface, on the boundary, or outside the boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GridNodeLocation GetGridNodeLocation(
	GridNode gridNode
)
Public Function GetGridNodeLocation (
	gridNode As GridNode
) As GridNodeLocation
public:
GridNodeLocation GetGridNodeLocation(
	GridNode gridNode
)
member GetGridNodeLocation :
        gridNode : GridNode -> GridNodeLocation
Parameters
gridNode GridNode
Return Value
GridNodeLocation
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when the grid node indexes are outside the range [ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ].
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace